
export const retriveLocalStorage =<T> (key: string) => {
    //тут ставимо що будемо шукати по ключу а не по конкретному значеню, тому що це можуть бути юзери, продукти і т.д.
    const object =localStorage.getItem(key) || '';  //якщо ключа не буде то вказуєм що повертається нічого стрінгового типу
    //далі робимо перевірку, що якщо object не існує то повертаємо пустий обєкт строго типізоваемй як тип даних в дженеріку T
    if(!object){
        return {} as T;
    }
    //у випадку якщо цього не станеться ми зробимо з вами змінну parse
    const parse = JSON.parse(object);
    return parse as T;
}